slide/tutorial-cpp/tutorial-cpp.org
#+TITLE: Tutorial -- =C++=
#+SETUPFILE: ../slide-setup.org
#+LATEX_HEADER: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Content}\tableofcontents[currentsection]\end{frame}}

* Get Started

** Good Program

   The greatest obstacle to learning to write good programs is a firm
   belief that (by Bjarne Stroustrup)

   - it is among the most difficult of technical skills
   - it is a skill that requires some rare talent
   - it is done by socially inept young men in total isolation, mostly
     by night
   - it is mostly about building violent video games
   - it is a skill that requires mastery of advanced mathematics
   - it is an activity completely different from everyday ways of
     thinking
   - it is something that doesn't help people

** Hello World!

   - Enter the source code with your favorite editor (Emacs for me)
     and save to file =hello.cpp=.

     #+BEGIN_SRC cpp
// my first C++ program
#include <iostream>
using namespace std;

int main() {
  cout << "Hello World!" << endl;
}
     #+END_SRC

   - Fire up the command line, compile with =g++ hello.cpp=.  An
     executable named =a.out= appears in the same directory.  Run it
     with =./a.out=.

** Hello World! -- Line 0

   #+BEGIN_SRC cpp
// my first C++ program
   #+END_SRC

   Comments are stripped by /cpp/ (c preprocessor).

   - Line comment.  Start with =//=, everything after it is ignored.

     #+BEGIN_SRC cpp
// comment
int main() {                    // comment
}
     #+END_SRC

   - Block comment.  Start with =/*= and end with =*/=.  Nested
     comment is not allowed.  Everything in between is ignored.

     #+BEGIN_SRC cpp
/* comment */
int main(/* comment */) { /* comment */
}
     #+END_SRC

** Hello World! -- Line 1

   #+BEGIN_SRC cpp
#include <iostream>
   #+END_SRC

   Preprocessor directives precede by a hash sign =#=.  They are
   interpreted by the preprocessor. This line

   - Search for the file =iostream= in standard search path, if not
     specified otherwise (with =-I=).

     #+BEGIN_EXAMPLE
/usr/local/include
libdir/gcc/target/version/include
/usr/target/include
/usr/include
     #+END_EXAMPLE

   - If found, copy everything to current file.  Otherwise error.

** Hello World! -- Line 2

   #+BEGIN_SRC cpp
using namespace std;
   #+END_SRC

   Everything declared in name space =std= is available, e.g., =cout=
   which is declared in =iostream=.

   #+BEGIN_SRC cpp
namespace std {
  // ...
  ostream cout;
  // ...
}
   #+END_SRC

   =namespace= is used to prevent name collision and global namespace
   polluting.

** Hello World! -- Line 3

   #+BEGIN_SRC cpp
// empty line
   #+END_SRC

   Spaces are allowed in =C++= anywhere between basic units.
   Different styles require different spaces for indentation, spaces
   around function names, etc.  E.g., K&R, Stroustrup Style, Google
   C++ Style Guide and etc.

   The International Obfuscated C Code Contest (IOCCC) is a good
   example of space usage.

** Hello World! -- Line 4

   #+BEGIN_SRC cpp
int main()
   #+END_SRC

   This line initiates the declaration of a function.  Essentially,
   their definition is introduced with a succession of
   - a return type, e.g., =int=,
   - a function name, e.g., =main=, and
   - a pair of parentheses =()=, optionally including parameters.


   =main= function is the /entry point/.  At most one definition is
   allowed.  No =main= function in libraries.

** Hello World! -- Line 4 & 6

   #+BEGIN_SRC cpp
{}
   #+END_SRC

   - The brace at line 5 ={= indicates the beginning of the main
     function and =}= the end of it.
   - Everything between brace pair is the /body/ of the function.
   - Brace pair is used to delimit /scope/ in =C++=.

** Hello World! -- Line 5

   #+BEGIN_SRC cpp
cout << "Hello World!" << endl;
   #+END_SRC

   This line is a =C++= statement.  Usually they are executed in the
   same order they appear unless Level 3 optimization (=-O3=)is on.

   - =cout= is character/console output.
   - =<<= is insertion operator.  Insert what follows into the output,
     i.e. print to the console.
   - The statement ends with *SEMICOLON (=;=)*.

** Environment

   - Platform :: By default I recommend *nix OS, choose whatever
        distribution you like, e.g. Ubuntu, CentOS.
     - Linux machine in Computer Lab and Davis Hall 123.  You may SSH
       to machines in Davis Hall 123.
     - Otherwise, do the configuration yourself.
   - IDE :: Integrated Development Environment, e.g., Visual Studio,
        CodeBlocks, Eclipse and etc., is not recommended for
        programming assignment.
   - Compiler :: I use =g++ 5.2.1= for =C++=.  So feel free to use any
        of the =C++11= features in the programming assignment.

** General

   The ISO =C++= standard defines two kinds of entities:
   - /Core language features/, such as built-in types (e.g., =char= and
     =int=) and loops (e.g., =for=-statements and =while=-statements)
   - /Standard-library components/ (in namespace =std=), such as
     containers (e.g., =vector= and =map=) and I/O operations (e.g.,
     =<<= and =getline()=).

     The standard-library components are perfectly ordinary =C++= code
     provided by /every/ =C++= implementation.

* =C++= Basics

** Variable

   Fundamental types include

   - Character :: Represents a single character, e.g., =char=.
   - Numeric integer :: Stores /exact/ integer value.  They vary in
        signedness and size, e.g., =int=, =long long=.
   - Floating-point :: Represent real values, such as 3.14 or 0.01,
        with different levels of precision, e.g., =float=, =double=.
   - Boolean :: Represent one of two states. e.g., =bool=.


   =C++= standard library (STL) provides extension such as
   =std::string=, =std::iterator= and etc.

** Literals

   Literals are constants refer to fixed values that the program may
   not alter.

   - Integers.  E.g., 212 =signed int= in decimal, 215u =unsigned
     int= in decimal, 0xFEEL =signed long= in hexadecimal, 066
     =signed int= in octal.
   - Floating points.  E.g., 3.1415, 3.1e-2, 1.f (note the dot in
     between).
   - Boolean literals, =true= and =false=.  0 is =false= and all
     others are =true=.

