slide/tutorial-cpp/tutorial-cpp.tex
% Created 2016-01-08 Fri 12:19
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[activate={true,nocompatibility},final,tracking=true,kerning=true,spacing=true,factor=1100,stretch=10,shrink=10]{microtype}
\usepackage{minted}
\usepackage{svg}
\usepackage[backend=biber,style=alphabetic]{biblatex}
\fvset{fontsize=\footnotesize}
\fvset{frame=lines}
\fvset{framesep=5pt}
\DeclareUnicodeCharacter{200B}{}
\addbibresource{~/Documents/comp3220/master/comp3220.bib}
\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Content}\tableofcontents[currentsection]\end{frame}}
\usetheme{default}
\author{Zhitao Gong}
\date{2016 Spring}
\title{Tutorial -- \texttt{C++}}
\subtitle{COMP3220 -- Principle of Programming Languages}
\hypersetup{
      pdfauthor={Zhitao Gong},
      pdftitle={Tutorial -- \texttt{C++}},
      pdfkeywords={},
      pdfsubject={},
      pdfcreator={Emacs 24.5.1 (Org mode 8.3.2)},
      pdflang={English},
      bookmarks=true,
      unicode=true,
      pdftoolbar=true,
      pdfmenubar=true,
      pdffitwindow=false,
      pdfstartview={FitW},
      pdfnewwindow=true,
      colorlinks=true,
      linkcolor=red,
      citecolor=green,
      filecolor=magenta,
      urlcolor=cyan}
\begin{document}

\maketitle
\begin{frame}{Outline}
\setcounter{tocdepth}{2}
\tableofcontents
\end{frame}


\section{Get Started}
\label{sec:orgheadline12}

\begin{frame}[label={sec:orgheadline1}]{Good Program}
The greatest obstacle to learning to write good programs is a firm
belief that (by Bjarne Stroustrup)

\begin{itemize}
\item it is among the most difficult of technical skills
\item it is a skill that requires some rare talent
\item it is done by socially inept young men in total isolation, mostly
by night
\item it is mostly about building violent video games
\item it is a skill that requires mastery of advanced mathematics
\item it is an activity completely different from everyday ways of
thinking
\item it is something that doesn't help people
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline2}]{Hello World!}
 \begin{itemize}
\item Enter the source code with your favorite editor (Emacs for me)
and save to file \texttt{hello.cpp}.

\begin{minted}[]{cpp}
// my first C++ program
#include <iostream>
using namespace std;

int main() {
  cout << "Hello World!" << endl;
}
\end{minted}

\item Fire up the command line, compile with \texttt{g++ hello.cpp}.  An
executable named \texttt{a.out} appears in the same directory.  Run it
with \texttt{./a.out}.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline3}]{Hello World! -- Line 0}
 \begin{minted}[]{cpp}
// my first C++ program
\end{minted}

Comments are stripped by \emph{cpp} (c preprocessor).

\begin{itemize}
\item Line comment.  Start with \texttt{//}, everything after it is ignored.

\begin{minted}[]{cpp}
// comment
int main() {                    // comment
}
\end{minted}

\item Block comment.  Start with \texttt{/*} and end with \texttt{*/}.  Nested
comment is not allowed.  Everything in between is ignored.

\begin{minted}[]{cpp}
/* comment */
int main(/* comment */) { /* comment */
}
\end{minted}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline4}]{Hello World! -- Line 1}
 \begin{minted}[]{cpp}
#include <iostream>
\end{minted}

Preprocessor directives precede by a hash sign \texttt{\#}.  They are
interpreted by the preprocessor. This line

\begin{itemize}
\item Search for the file \texttt{iostream} in standard search path, if not
specified otherwise (with \texttt{-I}).

\begin{verbatim}
/usr/local/include
libdir/gcc/target/version/include
/usr/target/include
/usr/include
\end{verbatim}

\item If found, copy everything to current file.  Otherwise error.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline5}]{Hello World! -- Line 2}
 \begin{minted}[]{cpp}
using namespace std;
\end{minted}

Everything declared in name space \texttt{std} is available, e.g., \texttt{cout}
which is declared in \texttt{iostream}.

\begin{minted}[]{cpp}
namespace std {
  // ...
  ostream cout;
  // ...
}
\end{minted}

\texttt{namespace} is used to prevent name collision and global namespace
polluting.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline6}]{Hello World! -- Line 3}
 \begin{minted}[]{cpp}
// empty line
\end{minted}

Spaces are allowed in \texttt{C++} anywhere between basic units.
Different styles require different spaces for indentation, spaces
around function names, etc.  E.g., K\&R, Stroustrup Style, Google
C++ Style Guide and etc.

The International Obfuscated C Code Contest (IOCCC) is a good
example of space usage.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline7}]{Hello World! -- Line 4}
 \begin{minted}[]{cpp}
int main()
\end{minted}

This line initiates the declaration of a function.  Essentially,
their definition is introduced with a succession of
\begin{itemize}
\item a return type, e.g., \texttt{int},
\item a function name, e.g., \texttt{main}, and
\item a pair of parentheses \texttt{()}, optionally including parameters.
\end{itemize}


\texttt{main} function is the \emph{entry point}.  At most one definition is
allowed.  No \texttt{main} function in libraries.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline8}]{Hello World! -- Line 4 \& 6}
 \begin{minted}[]{cpp}
{}
\end{minted}

\begin{itemize}
\item The brace at line 5 \texttt{\{} indicates the beginning of the main
function and \texttt{\}} the end of it.
\item Everything between brace pair is the \emph{body} of the function.
\item Brace pair is used to delimit \emph{scope} in \texttt{C++}.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline9}]{Hello World! -- Line 5}
 \begin{minted}[]{cpp}
cout << "Hello World!" << endl;
\end{minted}

This line is a \texttt{C++} statement.  Usually they are executed in the
same order they appear unless Level 3 optimization (\texttt{-O3})is on.

\begin{itemize}
\item \texttt{cout} is character/console output.
\item \texttt{<<} is insertion operator.  Insert what follows into the output,
i.e. print to the console.
\item The statement ends with \alert{SEMICOLON (\texttt{;})}.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline10}]{Environment}
 \begin{description}
\item[{Platform}] By default I recommend *nix OS, choose whatever
distribution you like, e.g. Ubuntu, CentOS.
\begin{itemize}
\item Linux machine in Computer Lab and Davis Hall 123.  You may SSH
to machines in Davis Hall 123.
\item Otherwise, do the configuration yourself.
\end{itemize}
\item[{IDE}] Integrated Development Environment, e.g., Visual Studio,
CodeBlocks, Eclipse and etc., is not recommended for
programming assignment.
\item[{Compiler}] I use \texttt{g++ 5.2.1} for \texttt{C++}.  So feel free to use any
of the \texttt{C++11} features in the programming assignment.
\end{description}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline11}]{General}
 The ISO \texttt{C++} standard defines two kinds of entities:
\begin{itemize}
\item \emph{Core language features}, such as built-in types (e.g., \texttt{char} and
\texttt{int}) and loops (e.g., \texttt{for}-statements and \texttt{while}-statements)
\item \emph{Standard-library components} (in namespace \texttt{std}), such as
containers (e.g., \texttt{vector} and \texttt{map}) and I/O operations (e.g.,
\texttt{<<} and \texttt{getline()}).

The standard-library components are perfectly ordinary \texttt{C++} code
provided by \emph{every} \texttt{C++} implementation.
\end{itemize}
\end{frame}


\section{\texttt{C++} Basics}
\label{sec:orgheadline32}

\begin{frame}[fragile,label={sec:orgheadline13}]{Variable}
 Fundamental types include

\begin{description}
\item[{Character}] Represents a single character, e.g., \texttt{char}.
\item[{Numeric integer}] Stores \emph{exact} integer value.  They vary in
signedness and size, e.g., \texttt{int}, \texttt{long long}.
\item[{Floating-point}] Represent real values, such as 3.14 or 0.01,
with different levels of precision, e.g., \texttt{float}, \texttt{double}.
\item[{Boolean}] Represent one of two states. e.g., \texttt{bool}.
\end{description}


\texttt{C++} standard library (STL) provides extension such as
\texttt{std::string}, \texttt{std::iterator} and etc.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline14}]{Literals}
 Literals are constants refer to fixed values that the program may
not alter.

\begin{itemize}
\item Integers.  E.g., 212 \texttt{signed int} in decimal, 215u \texttt{unsigned
     int} in decimal, 0xFEEL \texttt{signed long} in hexadecimal, 066
\texttt{signed int} in octal.
\item Floating points.  E.g., 3.1415, 3.1e-2, 1.f (note the dot in
between).
\item Boolean literals, \texttt{true} and \texttt{false}.  0 is \texttt{false} and all
others are \texttt{true}.
\end{itemize}
\end{frame}
