slide/tutorial-cpp/tutorial-cpp.org
** Arithmetic

   These are the basic arithmetic operators in =C++=.

   #+BEGIN_SRC cpp
int main() {
  int x = 3, y = 4;
  x + y;                        // plus
  +x;                           // unary plus
  x - y;                        // minus
  -x;                           // unary minus
  x * y;                        // multiply
  x / y;                        // divide
  x % y;                        // remainder (modulus, integer only)
}
   #+END_SRC

** Comparison

   These are the basic comparison operators.

   #+BEGIN_SRC cpp
int main() {
  int x = 4, y = 3;
  x == y;                       // equal (BE CAREFUL for float)
  x != y;                       // not equal
  x < y;                        // less than
  x > y;                        // greater than
  x <= y;                       // less than or equal
  x >= y;                       // greater than or equal
}
   #+END_SRC

** Logic

   Logic operators include

   #+BEGIN_SRC cpp
int main() {
  int x = 3, y = 1;
  x & y;                        // bitwise AND
  x | y;                        // bitwise OR
  x ^ y;                        // bitwise XOR
  ~x;                           // bitwise complement
  x && y;                       // logic AND
  x || y;                       // logic OR
}
   #+END_SRC

   - A bitwise logical operator yields a result of their operand type
     for which the operation has been performed on each bit.
   - The logical operators =&&= and =||= simply return =true= or
     =false= depending on the values of their operands.

** Assignment

   #+BEGIN_SRC cpp
int main() {
  int a = 5;                    // OK, a lvalue, 5 rvalue
  a + 3 = 4;                    // WRONG, a + 3 rvalue
  int a = 5.243;                // narrowing conversion
}
   #+END_SRC

   - L-value :: Expressions that refer to a memory location,
        potentially allowing new values to be assigned.  An lvalue may
        appear as either the left-hand or right-hand side of an
        assignment.
   - R-value :: That are not L-values.  They may appear only on the
        right hand side of the assignment.

** Conversion

   =C++= performs all /meaningful conversions/ between the basic types
   so that they can be mixed freely.

   - Usual Arithmetic Conversions :: Conversions used in expressions
        aim to ensure that expressions are computed at the /highest
        precision/ of its operands.


   #+BEGIN_SRC cpp
int main() {
  int x = 3;
  double b = 4;
  char c = 'a';
  x + b;                        // x is converted to double
  c + x;                        // c is converted to int
}
   #+END_SRC

** Variable Initialization

   - Don't introduce a name until you have a suitable value for it.
   - ~=~-form is traditional and dates back to =C=.  If in doubt, use
     the general ={}=-list form, which saves you from conversions that
     lose information, i.e., narrowing conversion.
   - Types may be deduced from the initializer.

   #+BEGIN_SRC cpp
int main () {
  int a = 5;          // initial value: 5
  int b(3);           // initial value: 3
  int c{2};           // initial value: 2
  int result;         // initial value undetermined
  auto d = a;         // d is integer 5, deduced type: int
  decltype(c) e;      // integer value undetermined

  int e{7.2};         // ERROR, narrowing conversion
  double f{'a'};      // OK
}
   #+END_SRC

** Shorthand Operators

   =C++= provides concise and convenient shorthand operators to modify
   variables.  All arithmetic and bitwise logic operators may be
   combined with ~=~.

   #+BEGIN_SRC cpp
int main() {
  int x = 4, y = 3;
  x += y;                       // x = x + y;
  ++x;                          // x = x + 1; use x;
  x++;                          // use x; x = x + 1;
  --x;                          // x = x - 1; use x;
  x--;                          // use x; x = x - 1;
  x *= y;                       // x = x * y;
  x |= y;                       // x = x | y;
}
   #+END_SRC

** Variable Scope

   Like most PL's, =C++= uses /lexical scoping/ or /static scoping/.
   A declaration introduces its name into a scope.

   - Local Scope :: /Local Name/ is declared in a function or lambda.
        Scope extends from the point of declaration to the end of the
        block where it is declared.
   - Class Scope :: /Member name/ (class member name) is defined in a
        class outside any function, lambda, or enum class.  Scope
        extends from the opening ={= of its enclosing declaration to
        the end of that declaration.
   - Namespace Scope :: /Namespace member name/ is defined in a
        namespace outside any function, lambda, class, or enum class.
        Scope extends from the point of declaration to the end of its
        namespace.


   A name not declared inside any other construct is called a global
   name and is said to be in the global namespace.

** Variable Scope Example

   An object /must/ be constructed/initialized before it is used and
   will be destroyed at the end of its scope.

   #+BEGIN_SRC cpp
struct foo {
  int count;                    // member name
};

int g = 4;                      // global

int main(int argc) {            // main is global, argc is local
  int a = 3;                    // local, visible in main
  {
    int b = 4;                  // local visible inside {}
  }
  int g = 3;                    // local g, shadows global g
  ::g = 40;                     // refer to global g
  c = 4;                        // ERROR!!
}
   #+END_SRC

** Constants

   - =const= :: "I promise not to change this value".  Primarily used
        to specify interfaces.
   - =constexpr= :: "To be evaluated at compile time".  Used primarily
        to specify constants, to allow placement of data in read-only
        memory.


   #+BEGIN_SRC cpp
constexpr int square(int n) { return n * n; }

int main() {
  const int a = 3;              // a is named constant
  int b = 3;                    // b is not constant

  constexpr int c = 1.4 * square(a); // OK
  constexpr int d = 1.4 * square(b); // ERROR
  const int e = 1.4 * square(b);     // OK
}
   #+END_SRC

** Array

   #+BEGIN_SRC cpp
int main() {
  int a[3]{1,2,3};           // array of 3 integers
  char b[4];                 // array of 4 characters
  int size = 10;
  int b[size] = {1,2,3};     // runtime-sized array c++14
  int c[3][4];
}
   #+END_SRC

   - In declarations, =[ ]= means "array of".
   - All array are 0-based.  So =a[0]= is the first element and =a[2]=
     is the last element.

** Multi-Dimensional Array

   In memory, milti-dimensional array is actually a long 1D array, in
   stored row-major order.

*** Syntax Sugar                                              :B_block:BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_env: block
    :END:

    #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int main () {
  const int W = 3;
  const int H = 2;
  int a[H][W] = {1, 2, 3, 4, 5, 6};

  for (int i = 0; i < H; ++i)
    for (int j = 0; j < W; ++j)
      cout << a[i][j] << endl;
}
    #+END_SRC

*** Pseudo Multi-Dimensional                            :B_block:BMCOL:
    :PROPERTIES:
    :BEAMER_col: 0.5
    :BEAMER_env: block
    :END:

    #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int main () {
  const int W = 3;
  const int H = 2;
  int a[H * W]{1, 2, 3, 4, 5, 6};

  for (int i = 0; i < H; ++i)
    for (int j = 0; j < W; ++j)
      cout << a[i * W + j] << endl;
}
    #+END_SRC

