slide/tutorial-cpp/tutorial-cpp.tex

\begin{frame}[fragile,label={sec:orgheadline15}]{Arithmetic}
 These are the basic arithmetic operators in \texttt{C++}.

\begin{minted}[]{cpp}
int main() {
  int x = 3, y = 4;
  x + y;                        // plus
  +x;                           // unary plus
  x - y;                        // minus
  -x;                           // unary minus
  x * y;                        // multiply
  x / y;                        // divide
  x % y;                        // remainder (modulus, integer only)
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline16}]{Comparison}
 These are the basic comparison operators.

\begin{minted}[]{cpp}
int main() {
  int x = 4, y = 3;
  x == y;                       // equal (BE CAREFUL for float)
  x != y;                       // not equal
  x < y;                        // less than
  x > y;                        // greater than
  x <= y;                       // less than or equal
  x >= y;                       // greater than or equal
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline17}]{Logic}
 Logic operators include

\begin{minted}[]{cpp}
int main() {
  int x = 3, y = 1;
  x & y;                        // bitwise AND
  x | y;                        // bitwise OR
  x ^ y;                        // bitwise XOR
  ~x;                           // bitwise complement
  x && y;                       // logic AND
  x || y;                       // logic OR
}
\end{minted}

\begin{itemize}
\item A bitwise logical operator yields a result of their operand type
for which the operation has been performed on each bit.
\item The logical operators \texttt{\&\&} and \texttt{||} simply return \texttt{true} or
\texttt{false} depending on the values of their operands.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline18}]{Assignment}
 \begin{minted}[]{cpp}
int main() {
  int a = 5;                    // OK, a lvalue, 5 rvalue
  a + 3 = 4;                    // WRONG, a + 3 rvalue
  int a = 5.243;                // narrowing conversion
}
\end{minted}

\begin{description}
\item[{L-value}] Expressions that refer to a memory location,
potentially allowing new values to be assigned.  An lvalue may
appear as either the left-hand or right-hand side of an
assignment.
\item[{R-value}] That are not L-values.  They may appear only on the
right hand side of the assignment.
\end{description}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline19}]{Conversion}
 \texttt{C++} performs all \emph{meaningful conversions} between the basic types
so that they can be mixed freely.

\begin{description}
\item[{Usual Arithmetic Conversions}] Conversions used in expressions
aim to ensure that expressions are computed at the \emph{highest
precision} of its operands.
\end{description}


\begin{minted}[]{cpp}
int main() {
  int x = 3;
  double b = 4;
  char c = 'a';
  x + b;                        // x is converted to double
  c + x;                        // c is converted to int
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline20}]{Variable Initialization}
 \begin{itemize}
\item Don't introduce a name until you have a suitable value for it.
\item \texttt{=}-form is traditional and dates back to \texttt{C}.  If in doubt, use
the general \texttt{\{\}}-list form, which saves you from conversions that
lose information, i.e., narrowing conversion.
\item Types may be deduced from the initializer.
\end{itemize}

\begin{minted}[]{cpp}
int main () {
  int a = 5;          // initial value: 5
  int b(3);           // initial value: 3
  int c{2};           // initial value: 2
  int result;         // initial value undetermined
  auto d = a;         // d is integer 5, deduced type: int
  decltype(c) e;      // integer value undetermined

  int e{7.2};         // ERROR, narrowing conversion
  double f{'a'};      // OK
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline21}]{Shorthand Operators}
 \texttt{C++} provides concise and convenient shorthand operators to modify
variables.  All arithmetic and bitwise logic operators may be
combined with \texttt{=}.

\begin{minted}[]{cpp}
int main() {
  int x = 4, y = 3;
  x += y;                       // x = x + y;
  ++x;                          // x = x + 1; use x;
  x++;                          // use x; x = x + 1;
  --x;                          // x = x - 1; use x;
  x--;                          // use x; x = x - 1;
  x *= y;                       // x = x * y;
  x |= y;                       // x = x | y;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline22}]{Variable Scope}
 Like most PL's, \texttt{C++} uses \emph{lexical scoping} or \emph{static scoping}.
A declaration introduces its name into a scope.

\begin{description}
\item[{Local Scope}] \emph{Local Name} is declared in a function or lambda.
Scope extends from the point of declaration to the end of the
block where it is declared.
\item[{Class Scope}] \emph{Member name} (class member name) is defined in a
class outside any function, lambda, or enum class.  Scope
extends from the opening \texttt{\{} of its enclosing declaration to
the end of that declaration.
\item[{Namespace Scope}] \emph{Namespace member name} is defined in a
namespace outside any function, lambda, class, or enum class.
Scope extends from the point of declaration to the end of its
namespace.
\end{description}


A name not declared inside any other construct is called a global
name and is said to be in the global namespace.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline23}]{Variable Scope Example}
 An object \emph{must} be constructed/initialized before it is used and
will be destroyed at the end of its scope.

\begin{minted}[]{cpp}
struct foo {
  int count;                    // member name
};

int g = 4;                      // global

int main(int argc) {            // main is global, argc is local
  int a = 3;                    // local, visible in main
  {
    int b = 4;                  // local visible inside {}
  }
  int g = 3;                    // local g, shadows global g
  ::g = 40;                     // refer to global g
  c = 4;                        // ERROR!!
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline24}]{Constants}
 \begin{description}
\item[{\texttt{const}}] "I promise not to change this value".  Primarily used
to specify interfaces.
\item[{\texttt{constexpr}}] "To be evaluated at compile time".  Used primarily
to specify constants, to allow placement of data in read-only
memory.
\end{description}


\begin{minted}[]{cpp}
constexpr int square(int n) { return n * n; }

int main() {
  const int a = 3;              // a is named constant
  int b = 3;                    // b is not constant

  constexpr int c = 1.4 * square(a); // OK
  constexpr int d = 1.4 * square(b); // ERROR
  const int e = 1.4 * square(b);     // OK
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline25}]{Array}
 \begin{minted}[]{cpp}
int main() {
  int a[3]{1,2,3};           // array of 3 integers
  char b[4];                 // array of 4 characters
  int size = 10;
  int b[size] = {1,2,3};     // runtime-sized array c++14
  int c[3][4];
}
\end{minted}

\begin{itemize}
\item In declarations, \texttt{[ ]} means "array of".
\item All array are 0-based.  So \texttt{a[0]} is the first element and \texttt{a[2]}
     is the last element.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline26}]{Multi-Dimensional Array}
 In memory, milti-dimensional array is actually a long 1D array, in
stored row-major order.

\begin{columns}
\begin{column}{0.5\columnwidth}
\begin{block}{Syntax Sugar}
\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int main () {
  const int W = 3;
  const int H = 2;
  int a[H][W] = {1, 2, 3, 4, 5, 6};

  for (int i = 0; i < H; ++i)
    for (int j = 0; j < W; ++j)
      cout << a[i][j] << endl;
}
\end{minted}
\end{block}
\end{column}

\begin{column}{0.5\columnwidth}
\begin{block}{Pseudo Multi-Dimensional}
\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int main () {
  const int W = 3;
  const int H = 2;
  int a[H * W]{1, 2, 3, 4, 5, 6};

  for (int i = 0; i < H; ++i)
    for (int j = 0; j < W; ++j)
      cout << a[i * W + j] << endl;
}
\end{minted}
\end{block}
\end{column}
\end{columns}
\end{frame}
