slide/tutorial-cpp/tutorial-cpp.org
** Character Array

   Strings in =C/C++= are represented by =char= array.  By convention,
   /null character/, '=\0=', is used as terminator, signaling the end
   of string.

   #+BEGIN_SRC cpp
#include <iostream>
#include <cstdio>
int main() {
  char foo[10] = "1234";
  std::cout << foo << std::endl;
  char bar[10] = "1234\0abcd";
  printf("%s\n", bar);
}
   #+END_SRC

** Pointer

   - Pointer type stores the /address/ of memory location, Pointer may
     change its value, i.e., point to another memory location.
   - Reference type is /auto de-referenced/ pointer.  But its memory
     address may not change.

   #+BEGIN_SRC cpp
int main() {
  int a = 3;
  int* b = &a;
  int& c = a;
  // a, b, c share a memory location
  (*b) = 4;
  c = 40;
}
   #+END_SRC

** Pointer Cont'd

   Prefix unary =*= means "contents of", and prefix unary =&= means
   "address of".  In declarations, operators (such as =&= , =*= and
   =[]=) are called /declarator operators/.


   - When we don't have an object to point to or
   - if we need to represent the notion of "no object available"
     (e.g., for an end of a list)

   The pointer is set the value =nullptr= ("the null pointer").  There
   is only one =nullptr= shared by all pointer types.

   #+BEGIN_SRC cpp
int main() {
  int* a = nullptr;
  double* b = nullptr;
  int x = nullptr;              // ERROR
}
   #+END_SRC

** Null Pointer

   In old code, 0 or =NULL= is typically used.  However, using
   =nullptr= eliminates potential confusion between integers, e.g., 0
   or =NULL=, and pointers, e.g., =nullptr= which is of type
   =std::nullptr_t=.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int main() {
  cout << (0 == nullptr) << endl;
  cout << (NULL == nullptr) << endl;
  cout << (0 == NULL) << endl;

  int a = NULL;                 // warning
  int x = nullptr;              // ERROR
}
   #+END_SRC

** Dynamic Memory

   - Allocating memory on heap with =new=.
     - allocating blocks of memory and
     - invoking constructor.
   - De-allocating memory with =delete=.
     - invoking destructor and
     - returning memory to system.

   #+BEGIN_SRC cpp
int main() {
  int* arr;
  arr = new int [10];
  delete[] arr;

  int* val;
  val = new int (3);
  delete val;
}
   #+END_SRC

* Control Structure

** Conditional Branch =if else=

   The condition is not necessary Boolean type.  It may also be types
   that could be /implicitly/ cast to Boolean, e.g., char, integer and
   etc.  If no curly bracket, only the first statement block belongs
   to =if=.

   #+BEGIN_SRC cpp
int main() {
  int a = 0;
  if (a) a = 100;
  else if (3 == a) a = 4;

  if (a)
    a -= 1;
  a -= 1;
}
   #+END_SRC

** Conditional Branch =switch case=

   The condition is expected to be integer-compatible.

   #+BEGIN_SRC cpp
int main() {
  int a = 2;
  switch (a) {
  case 1: { a -= 1; break; }
  case 2: a -= 2; /* missing break */
  case 3: a -= 3; break;
  default: a -= 0;
  }
}
   #+END_SRC

   Remember the =break= statement at the end of every =case= unless
   intended otherwise.  Curly bracket for each =case= body is
   optional.

** Unconditional Branch =goto=

   Avoid =goto=.  The only useful case I know is deeply nested loop.

   #+BEGIN_SRC cpp
int main() {
  for (int i = 0; i < 3; ++i) {
    for (int j = 0; j < i; ++j) {
      for (int k = 0; k < 100; ++k)
        if (5 == k) goto end;
    }
  }

 end:
  ;
}
   #+END_SRC

** Loop =for=

   - Initial expression is evaluated *once before* the loop.
   - Termination condition is evaluated *before* every loop.
   - Iteration expression is evaluated *after* every loop.


   #+BEGIN_SRC cpp
int main() {
  int b = 10;
  for (int i = 0; i < b; ++i) {
    b -= 2;
    int c;   // visible only inside for
  }
}
   #+END_SRC

** Loop Range =for=

   Since =C++11=, a new =for= loop syntax is available.

   #+BEGIN_SRC cpp
#include <iostream>

int main() {
  int a[3]{1, 2, 3};
  for (int i : a) {
    std::cout << i << std::endl;
  }
}
   #+END_SRC

** Loop =while=

   The two loop structures are equivalent:
   - =while(cond) { }=
   - =for(; cond; ) { }=

   #+BEGIN_SRC cpp
int main() {
  int a = 3;
  while (a > 0) --a;

  int b = 4;
  do {
    --b;
  } while (b > 0);

  int c = 4;
  while (--c > 0) /* empty */ ;
}
   #+END_SRC

* Function

** Function

   Function consists of return type, function name, argument list and
   function body.

   #+BEGIN_SRC cpp
int foo(int a, int b = 3) {
  return a + b;
}
int bar(int a, int b = 3, int c) { // WRONG
  return 0;
}
int fun();
int main() {
  int b = foo(3);
  int c = foo(3, 4);
  fun();
}
int fun() { }
   #+END_SRC

** Function Side Effect

   =C++= allows functions to have /side effects/.

   #+BEGIN_SRC cpp
#include <iostream>
int f0(int a) { a -= 1; return a; }
int f1(int& a) { a -= 1; return a; }
int f2(int* a) { *a -= 1; return a; }

int main() {
  int a = 3;
  f0(a);     // value of a?
  f1(a);     // value of a?
  f2(&a);    // value of a?
  std::cout << f1(a) << std::endl;
  std::cout << a << std::endl;
}
   #+END_SRC

** Lambda Function

   It is introduced in =C++11=.
   - Lambda function :: Constructs a closure: an unnamed function
        object capable of capturing variables in scope.

   #+BEGIN_SRC cpp
#include <functional>
#include <iostream>
int main() {
  int a = 10;
  std::function<int(int)> func = [&](int p) { return (a += p); };
  std::cout << func(33) << std::endl;
  std::cout << a << std::endl;
}
   #+END_SRC

** Overloading

   Tow different functions may have the same name if their parameter
   are different
   - different number of parameters, or
   - any of their parameters are of a different type.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int add(int a, int b) { return a + b; }
float add(float a, int b) { return a + b; }

int main() {
  cout << add(3, 4) << endl;
  cout << add(2.3f, 4) << endl;
  cout << add(2.3, 4) << endl;  // ERROR, ambiguous
  cout << add(2.3, 3.4) << endl; // ERROR, ambiguous
}
   #+END_SRC

** Preprocessor Directives

   - Preprocessor directives are lines preceded by a hash sign =#=.
   - The preprocessor process these directives *before* compilation.
   - Backslash =\= may be used to extend a directive to multiline.

** Directives -- Macro

   =#define= and =#undef=.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

#define SIZE 3
#define max(a, b) (a) > (b) ? (a) : (b)
#define str(x) #x
#define glue(a,b) a ## b

int main() {
  int v[SIZE];
  max(3, 4);
#undef SIZE
  char m[SIZE];                 // ERROR

  glue(c, out) << str(Hello\nWor
              ld!) << endl;
}
   #+END_SRC

** Directives -- Conditional Inclusion

   =#ifdef=, =#ifndef=, =#if=, =#endif=, =#else= and =#elif=.

   #+BEGIN_SRC cpp
int main() {
#ifdef SIZE
  int v[SIZE];
#else
  int v[10];
#endif
}
   #+END_SRC

   is equivalent to

   #+BEGIN_SRC cpp
int main() {
  int v[10];
}
   #+END_SRC

