slide/tutorial-cpp/tutorial-cpp.tex

\begin{frame}[fragile,label={sec:orgheadline27}]{Character Array}
 Strings in \texttt{C/C++} are represented by \texttt{char} array.  By convention,
\emph{null character}, '\texttt{\textbackslash{}0}', is used as terminator, signaling the end
of string.

\begin{minted}[]{cpp}
#include <iostream>
#include <cstdio>
int main() {
  char foo[10] = "1234";
  std::cout << foo << std::endl;
  char bar[10] = "1234\0abcd";
  printf("%s\n", bar);
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline28}]{Pointer}
 \begin{itemize}
\item Pointer type stores the \emph{address} of memory location, Pointer may
change its value, i.e., point to another memory location.
\item Reference type is \emph{auto de-referenced} pointer.  But its memory
address may not change.
\end{itemize}

\begin{minted}[]{cpp}
int main() {
  int a = 3;
  int* b = &a;
  int& c = a;
  // a, b, c share a memory location
  (*b) = 4;
  c = 40;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline29}]{Pointer Cont'd}
 Prefix unary \texttt{*} means "contents of", and prefix unary \texttt{\&} means
"address of".  In declarations, operators (such as \texttt{\&} , \texttt{*} and
\texttt{[]}) are called \emph{declarator operators}.


\begin{itemize}
\item When we don't have an object to point to or
\item if we need to represent the notion of "no object available"
(e.g., for an end of a list)
\end{itemize}

The pointer is set the value \texttt{nullptr} ("the null pointer").  There
is only one \texttt{nullptr} shared by all pointer types.

\begin{minted}[]{cpp}
int main() {
  int* a = nullptr;
  double* b = nullptr;
  int x = nullptr;              // ERROR
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline30}]{Null Pointer}
 In old code, 0 or \texttt{NULL} is typically used.  However, using
\texttt{nullptr} eliminates potential confusion between integers, e.g., 0
or \texttt{NULL}, and pointers, e.g., \texttt{nullptr} which is of type
\texttt{std::nullptr\_t}.

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int main() {
  cout << (0 == nullptr) << endl;
  cout << (NULL == nullptr) << endl;
  cout << (0 == NULL) << endl;

  int a = NULL;                 // warning
  int x = nullptr;              // ERROR
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline31}]{Dynamic Memory}
 \begin{itemize}
\item Allocating memory on heap with \texttt{new}.
\begin{itemize}
\item allocating blocks of memory and
\item invoking constructor.
\end{itemize}
\item De-allocating memory with \texttt{delete}.
\begin{itemize}
\item invoking destructor and
\item returning memory to system.
\end{itemize}
\end{itemize}

\begin{minted}[]{cpp}
int main() {
  int* arr;
  arr = new int [10];
  delete[] arr;

  int* val;
  val = new int (3);
  delete val;
}
\end{minted}
\end{frame}

\section{Control Structure}
\label{sec:orgheadline39}

\begin{frame}[fragile,label={sec:orgheadline33}]{Conditional Branch \texttt{if else}}
 The condition is not necessary Boolean type.  It may also be types
that could be \emph{implicitly} cast to Boolean, e.g., char, integer and
etc.  If no curly bracket, only the first statement block belongs
to \texttt{if}.

\begin{minted}[]{cpp}
int main() {
  int a = 0;
  if (a) a = 100;
  else if (3 == a) a = 4;

  if (a)
    a -= 1;
  a -= 1;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline34}]{Conditional Branch \texttt{switch case}}
 The condition is expected to be integer-compatible.

\begin{minted}[]{cpp}
int main() {
  int a = 2;
  switch (a) {
  case 1: { a -= 1; break; }
  case 2: a -= 2; /* missing break */
  case 3: a -= 3; break;
  default: a -= 0;
  }
}
\end{minted}

Remember the \texttt{break} statement at the end of every \texttt{case} unless
intended otherwise.  Curly bracket for each \texttt{case} body is
optional.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline35}]{Unconditional Branch \texttt{goto}}
 Avoid \texttt{goto}.  The only useful case I know is deeply nested loop.

\begin{minted}[]{cpp}
int main() {
  for (int i = 0; i < 3; ++i) {
    for (int j = 0; j < i; ++j) {
      for (int k = 0; k < 100; ++k)
        if (5 == k) goto end;
    }
  }

 end:
  ;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline36}]{Loop \texttt{for}}
 \begin{itemize}
\item Initial expression is evaluated \alert{once before} the loop.
\item Termination condition is evaluated \alert{before} every loop.
\item Iteration expression is evaluated \alert{after} every loop.
\end{itemize}


\begin{minted}[]{cpp}
int main() {
  int b = 10;
  for (int i = 0; i < b; ++i) {
    b -= 2;
    int c;   // visible only inside for
  }
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline37}]{Loop Range \texttt{for}}
 Since \texttt{C++11}, a new \texttt{for} loop syntax is available.

\begin{minted}[]{cpp}
#include <iostream>

int main() {
  int a[3]{1, 2, 3};
  for (int i : a) {
    std::cout << i << std::endl;
  }
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline38}]{Loop \texttt{while}}
 The two loop structures are equivalent:
\begin{itemize}
\item \texttt{while(cond) \{ \}}
\item \texttt{for(; cond; ) \{ \}}
\end{itemize}

\begin{minted}[]{cpp}
int main() {
  int a = 3;
  while (a > 0) --a;

  int b = 4;
  do {
    --b;
  } while (b > 0);

  int c = 4;
  while (--c > 0) /* empty */ ;
}
\end{minted}
\end{frame}

\section{Function}
\label{sec:orgheadline52}

\begin{frame}[fragile,label={sec:orgheadline40}]{Function}
 Function consists of return type, function name, argument list and
function body.

\begin{minted}[]{cpp}
int foo(int a, int b = 3) {
  return a + b;
}
int bar(int a, int b = 3, int c) { // WRONG
  return 0;
}
int fun();
int main() {
  int b = foo(3);
  int c = foo(3, 4);
  fun();
}
int fun() { }
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline41}]{Function Side Effect}
 \texttt{C++} allows functions to have \emph{side effects}.

\begin{minted}[]{cpp}
#include <iostream>
int f0(int a) { a -= 1; return a; }
int f1(int& a) { a -= 1; return a; }
int f2(int* a) { *a -= 1; return a; }

int main() {
  int a = 3;
  f0(a);     // value of a?
  f1(a);     // value of a?
  f2(&a);    // value of a?
  std::cout << f1(a) << std::endl;
  std::cout << a << std::endl;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline42}]{Lambda Function}
 It is introduced in \texttt{C++11}.
\begin{description}
\item[{Lambda function}] Constructs a closure: an unnamed function
object capable of capturing variables in scope.
\end{description}

\begin{minted}[]{cpp}
#include <functional>
#include <iostream>
int main() {
  int a = 10;
  std::function<int(int)> func = [&](int p) { return (a += p); };
  std::cout << func(33) << std::endl;
  std::cout << a << std::endl;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline43}]{Overloading}
 Tow different functions may have the same name if their parameter
are different
\begin{itemize}
\item different number of parameters, or
\item any of their parameters are of a different type.
\end{itemize}

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int add(int a, int b) { return a + b; }
float add(float a, int b) { return a + b; }

int main() {
  cout << add(3, 4) << endl;
  cout << add(2.3f, 4) << endl;
  cout << add(2.3, 4) << endl;  // ERROR, ambiguous
  cout << add(2.3, 3.4) << endl; // ERROR, ambiguous
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline44}]{Preprocessor Directives}
 \begin{itemize}
\item Preprocessor directives are lines preceded by a hash sign \texttt{\#}.
\item The preprocessor process these directives \alert{before} compilation.
\item Backslash \texttt{\textbackslash{}} may be used to extend a directive to multiline.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline45}]{Directives -- Macro}
 \texttt{\#define} and \texttt{\#undef}.

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

#define SIZE 3
#define max(a, b) (a) > (b) ? (a) : (b)
#define str(x) #x
#define glue(a,b) a ## b

int main() {
  int v[SIZE];
  max(3, 4);
#undef SIZE
  char m[SIZE];                 // ERROR

  glue(c, out) << str(Hello\nWor
              ld!) << endl;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline46}]{Directives -- Conditional Inclusion}
 \texttt{\#ifdef}, \texttt{\#ifndef}, \texttt{\#if}, \texttt{\#endif}, \texttt{\#else} and \texttt{\#elif}.

\begin{minted}[]{cpp}
int main() {
#ifdef SIZE
  int v[SIZE];
#else
  int v[10];
#endif
}
\end{minted}

is equivalent to

\begin{minted}[]{cpp}
int main() {
  int v[10];
}
\end{minted}
\end{frame}
