slide/tutorial-cpp/tutorial-cpp.org
** Directive -- Line Control

   #+BEGIN_SRC cpp
int main() {
#line 11 "Test Message"
  int 3a;
}
   #+END_SRC

   Generates error message

   #+BEGIN_EXAMPLE
Test Message: In function ‘int main()’:
Test Message:11:7: error: ...
   #+END_EXAMPLE

   Without =#line=

   #+BEGIN_EXAMPLE
test.cpp: In function ‘int main()’:
test.cpp:3:7: error: ...
   #+END_EXAMPLE

   You don't actually need to set this directive manually.

** Directive -- Error

   #+BEGIN_SRC cpp
#if __cplusplus > 10
#error A C++ compiler is required!
#endif

int main() {
  int a;
}
   #+END_SRC

   This directive aborts the compilation process when it is found,
   generating a compilation error that can be specified as its
   parameter.

** Directive -- Inclusion

   #+BEGIN_SRC cpp
#include <iostream>
#include "header.h"

int main() { }
   #+END_SRC

   - The first header, between angle-brakets, is system wide header
     files, i.e., those in system search path.
   - The second header, between double quotes, is searched locally
     then system wide if failed.

** Directive -- Pragma

   This directive is used to specify diverse options to the compiler.
   Compiler /silently/ ignores this directive if no support.

   #+BEGIN_SRC cpp
#ifndef FOO_H_
#define FOO_H_

#prama once                     // include only once

class Foo { };

#endif /* FOO_H_ */
   #+END_SRC

** Predefined Macros

   The following macros are set by the compilers.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int main() {
  cout << __LINE__ << endl
       << __FILE__ << endl
       << __DATE__ << endl
       << __TIME__ << endl
       << __cplusplus << endl;
}
   #+END_SRC

* User-Defined Types

** Enumeration

   #+BEGIN_SRC cpp
int main() {
  enum class Color {Red, Yellow, Green};
  enum class TrafficLight {Red, Yellow, Green};

  Color color = Color::Red;
  TrafficLight tl = TrafficLight::Red;
}
   #+END_SRC

   Enumerators, e.g., =Red=, resides in the scope of their =enum
   class=.  =Color::Red= is different from =TrafficLight::Red=.

   Primarily used to make code more readable and less error-prone.

   By default, the integer values of enumerators starts with 0 and
   increases by one for each additional enumerator.

** =enum class= vs =enum=

   =enum class= is strongly typed.

   #+BEGIN_SRC cpp
int main() {
  enum class Color1 {Red, Yellow, Green};
  enum class Color2 {Red, Yellow, Green};
  enum       Color3 {Red, Yellow, Green};

  Color1 x = Red;               // ERROR
  Color1 y = Color2::Red;       // ERROR
  Color1 z = 2;                 // ERROR
  Color3 a = 2;                 // ERROR
  int i = Color1::Red;          // ERROR
  int j = Color3::Red;          // OK
  int k = Red;                  // OK, Color3::Red
}
   #+END_SRC

** =enum class= Operation

   By default, =enum class= supports assignment, initialization and
   comparisons.  Additional operation may be defined.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;
enum class Color {Red, Yellow, Green};
Color& operator++(Color& t) {
  switch (t) {
  case Color::Green: return t = Color::Yellow;
  case Color::Yellow: return t = Color::Red;
  case Color::Red: return t = Color::Green;
  }
}
int main() {
  Color c = Color::Red;
  cout << static_cast<std::underlying_type<Color>::type>(c) << endl;
}
   #+END_SRC

** Structures

   - General syntax for declaration and intialization
   - Main usage, i.e., collect data
   - Access fields

   See the accompany code and comments.

   #+BEGIN_SRC c++ :tangle src/demo-struct.cpp :exports none
// point-struct.cpp

#include <iostream>
#include <string>

// For convenient, we include everything from std.  Normally if you
// are writing a library, DO NOT do this.
using namespace std;

struct Student {
  string tiger_id;
  int age;
  string first_name;
  string last_name;
};                              // REMEMBER THIS REMICOLON!!!

void print_student_info(const Student& s, ostream& os = cout)
{
  os << "tiger_id: " <<  s.tiger_id << endl
     << "age: " << s.age << endl
     << "first_name: " << s.first_name << endl
     << "last_name: " << s.last_name << endl;
}

// One way for a function to return multiple values
Student gen_null_student()
{
  return {"0", "0", "f", "l"};
}

int main()
{
  // Full initialized
  Student s0 {"1", 20, "f0", "l0"};
  print_student_info(s0);

  // Default value
  Student s1 {"2"};
  print_student_info(s1);

  // Dot notation to access fields.
  s0.tiger_id = "3";
  s1.age = 100;

  // -----------------------------------------------------------------

  // Pointer to struct
  Student* s2 = new Student {"3", 40, "f2"};

  // For pointers we use -> to access fields.
  s2->tiger_id = "100";
  s2->age = -3;

  print_student_info(*s2);
  delete s2;                    // Remember to return space

  // -----------------------------------------------------------------

  // size of Student?  Extra space?  For performance reasons, the
  // compiler will sometimes add gaps into structures, i.e.  padding.
  cout << sizeof(Student) << endl;
  cout << sizeof(s0) << endl;
  cout << sizeof(string) << endl;
}
   #+END_SRC

** Unions

   - Union :: A struct in which all members are allocated at the same
        address so that the it occupies only as much space as its
        largest member.  The most recent written member is /active/.
        Only one member is active at a time.


   It's /undefined behavior/ to read from the member of the union that
   wasn't most recently written.  Many compilers implement, as a
   non-standard language extension, the ability to read inactive
   members of a union.

   #+BEGIN_SRC cpp :tangle src/demo-union.cpp :exports none
#include <cstdio>
#include <cstdint>
using namespace std;

int main() {
  // How integer is stored in memory?

  union U0 {
    std::int32_t n;
    std::uint8_t c[4];
  };

  U0 u0;
  u0.n = -1;
  for (auto i : u0.c)
    printf("%02x", i);
  printf("\n");

  u0.n = 1;
  for (auto i : u0.c)
    printf("%02x", i);
  printf("\n");

  u0.n = 2;
  for (auto i : u0.c)
    printf("%02x", i);
  printf("\n");
}
   #+END_SRC

** Classes

   - Basic syntax for declaration and definition
   - Techniques and concepts, e.g., abstract/concrete class,
     inheritance, interface, etc.
   - Operator overloading
   - Separate compiling, modularity

   - Demo Complex Class

     #+BEGIN_SRC makefile :tangle src/Makefile :exports none
CXX=g++
CXXFLAGS=-std=c++11 -Wall

all : complex-demo

complex-demo : complex main

complex : complex.cpp complex.h
	$(CXX) -$(CXXFLAGS) -c -o libcomplex.so $<

main : complex-demo.cpp complex
	$(CXX) -$(CXXFLAGS) -L. -lcomplex $<

clean :
	rm -rf *.so *.out

.PHONY : all clean complex-demo complex main

     #+END_SRC

     #+BEGIN_SRC cpp :tangle src/complex.h :exports none :main no
#ifndef COMPLEX_H_
#define COMPLEX_H_

#pragma once

namespace ppl {

class Complex {
 public:
  Complex(double real = 0.0, double imag = 0.0);

  double real() const { return real_; }
  double imag() const { return imag_; }
  void set_real(double real) { real_ = real; }
  void set_imag(double imag) { imag_ = imag; }

  Complex& operator += (const Complex& c);
  Complex& operator -= (const Complex& c);
  Complex& operator *= (const Complex& c);
  Complex& operator /= (const Complex& c);

 private:
  double real_, imag_;
};

Complex operator + (const Complex& a, const Complex& b);
Complex operator - (const Complex& a, const Complex& b);
Complex operator - (const Complex& a);
Complex operator * (const Complex& a, const Complex& b);
Complex operator / (const Complex& a, const Complex& b);

bool operator == (const Complex& a, const Complex& b);
}  // namespace ppl

#endif /* COMPLEX_H_ */
     #+END_SRC

     #+BEGIN_SRC cpp :tangle src/complex.cpp :exports none :main no
#include "complex.h"

namespace ppl {

Complex::Complex(double real, double imag)
    : real_(real), imag_(imag)
{ }

Complex& Complex::operator+=(const Complex& c)
{
  this->real_ += c.real_;
  imag_ += c.imag_;

  return *this;
}

Complex& Complex::operator-=(const Complex& c)
{
  // TODO
}

Complex& Complex::operator*=(const Complex& c)
{
  // TODO
}

Complex& Complex::operator/=(const Complex& c)
{
  // TODO
}

Complex operator+(const Complex& a, const Complex& b)
{
  return {a.real() + b.real(), a.imag() + b.imag()};
}

Complex operator-(const Complex& a, const Complex& b)
{
  // TODO
}

Complex operator-(const Complex& a)
{
  // TODO
}

Complex operator*(const Complex& a, const Complex& b)
{
  // TODO
}

Complex operator/(const Complex& a, const Complex& b)
{
  // TODO
}

bool operator==(const Complex& a, const Complex& b)
{
  // TODO
}

}  // namespace ppl
     #+END_SRC

     #+BEGIN_SRC cpp :tangle src/complex-demo.cpp :exports none
#include <iostream>
using namespace std;

#include "complex.h"

int main() {
  using namespace ppl;

  Complex a{1, 2};
  Complex b;
  Complex c{1.0};
}
     #+END_SRC

* Standard Library

** Standard Library Components

   - run-time language support, e.g., for allocation and run-time type
     information.
   - The C standard library, e.g., =cstdio=, =cmath=.
   - strings, support for international character sets and
     localization
   - regular expression
   - I/O streams
   - a framework of containers, e.g., =vector=, =map= and algorithms,
     e.g., =find()=, =sort()=.
   - support for numeric computation
   - support for concurrent programming
   - support for template metaprogramming
   - smart pointer

