slide/tutorial-cpp/tutorial-cpp.tex

\begin{frame}[fragile,label={sec:orgheadline47}]{Directive -- Line Control}
 \begin{minted}[]{cpp}
int main() {
#line 11 "Test Message"
  int 3a;
}
\end{minted}

Generates error message

\begin{verbatim}
Test Message: In function ‘int main()’:
Test Message:11:7: error: ...
\end{verbatim}

Without \texttt{\#line}

\begin{verbatim}
test.cpp: In function ‘int main()’:
test.cpp:3:7: error: ...
\end{verbatim}

You don't actually need to set this directive manually.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline48}]{Directive -- Error}
 \begin{minted}[]{cpp}
#if __cplusplus > 10
#error A C++ compiler is required!
#endif

int main() {
  int a;
}
\end{minted}

This directive aborts the compilation process when it is found,
generating a compilation error that can be specified as its
parameter.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline49}]{Directive -- Inclusion}
 \begin{minted}[]{cpp}
#include <iostream>
#include "header.h"

int main() { }
\end{minted}

\begin{itemize}
\item The first header, between angle-brakets, is system wide header
files, i.e., those in system search path.
\item The second header, between double quotes, is searched locally
then system wide if failed.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline50}]{Directive -- Pragma}
 This directive is used to specify diverse options to the compiler.
Compiler \emph{silently} ignores this directive if no support.

\begin{minted}[]{cpp}
#ifndef FOO_H_
#define FOO_H_

#prama once                     // include only once

class Foo { };

#endif /* FOO_H_ */
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline51}]{Predefined Macros}
 The following macros are set by the compilers.

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int main() {
  cout << __LINE__ << endl
       << __FILE__ << endl
       << __DATE__ << endl
       << __TIME__ << endl
       << __cplusplus << endl;
}
\end{minted}
\end{frame}

\section{User-Defined Types}
\label{sec:orgheadline59}

\begin{frame}[fragile,label={sec:orgheadline53}]{Enumeration}
 \begin{minted}[]{cpp}
int main() {
  enum class Color {Red, Yellow, Green};
  enum class TrafficLight {Red, Yellow, Green};

  Color color = Color::Red;
  TrafficLight tl = TrafficLight::Red;
}
\end{minted}

Enumerators, e.g., \texttt{Red}, resides in the scope of their \texttt{enum
   class}.  \texttt{Color::Red} is different from \texttt{TrafficLight::Red}.

Primarily used to make code more readable and less error-prone.

By default, the integer values of enumerators starts with 0 and
increases by one for each additional enumerator.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline54}]{\texttt{enum class} vs \texttt{enum}}
 \texttt{enum class} is strongly typed.

\begin{minted}[]{cpp}
int main() {
  enum class Color1 {Red, Yellow, Green};
  enum class Color2 {Red, Yellow, Green};
  enum       Color3 {Red, Yellow, Green};

  Color1 x = Red;               // ERROR
  Color1 y = Color2::Red;       // ERROR
  Color1 z = 2;                 // ERROR
  Color3 a = 2;                 // ERROR
  int i = Color1::Red;          // ERROR
  int j = Color3::Red;          // OK
  int k = Red;                  // OK, Color3::Red
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline55}]{\texttt{enum class} Operation}
 By default, \texttt{enum class} supports assignment, initialization and
comparisons.  Additional operation may be defined.

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;
enum class Color {Red, Yellow, Green};
Color& operator++(Color& t) {
  switch (t) {
  case Color::Green: return t = Color::Yellow;
  case Color::Yellow: return t = Color::Red;
  case Color::Red: return t = Color::Green;
  }
}
int main() {
  Color c = Color::Red;
  cout << static_cast<std::underlying_type<Color>::type>(c) << endl;
}
\end{minted}
\end{frame}

\begin{frame}[label={sec:orgheadline56}]{Structures}
\begin{itemize}
\item General syntax for declaration and intialization
\item Main usage, i.e., collect data
\item Access fields
\end{itemize}

See the accompany code and comments.
\end{frame}

\begin{frame}[label={sec:orgheadline57}]{Unions}
\begin{description}
\item[{Union}] A struct in which all members are allocated at the same
address so that the it occupies only as much space as its
largest member.  The most recent written member is \emph{active}.
Only one member is active at a time.
\end{description}


It's \emph{undefined behavior} to read from the member of the union that
wasn't most recently written.  Many compilers implement, as a
non-standard language extension, the ability to read inactive
members of a union.
\end{frame}

\begin{frame}[label={sec:orgheadline58}]{Classes}
\begin{itemize}
\item Basic syntax for declaration and definition
\item Techniques and concepts, e.g., abstract/concrete class,
inheritance, interface, etc.
\item Operator overloading
\item Separate compiling, modularity

\item Demo Complex Class
\end{itemize}
\end{frame}

\section{Standard Library}
\label{sec:orgheadline80}

\begin{frame}[fragile,label={sec:orgheadline60}]{Standard Library Components}
 \begin{itemize}
\item run-time language support, e.g., for allocation and run-time type
information.
\item The C standard library, e.g., \texttt{cstdio}, \texttt{cmath}.
\item strings, support for international character sets and
localization
\item regular expression
\item I/O streams
\item a framework of containers, e.g., \texttt{vector}, \texttt{map} and algorithms,
e.g., \texttt{find()}, \texttt{sort()}.
\item support for numeric computation
\item support for concurrent programming
\item support for template metaprogramming
\item smart pointer
\end{itemize}
\end{frame}
