slide/tutorial-cpp/tutorial-cpp.org
** Use Standard Library

   Every standard library is provided through some standard header.

   #+BEGIN_SRC cpp
#include <vector>               // vetor container
#include <string>               // string support

int main() {
  std::vector<int> v0{1, 2, 3};
  std::vector<std::string> v1{"string", "string"};
}
   #+END_SRC

   The standard library is defined in a namespace called =std=.  To
   use standard library utilities, the =std::= prefix can be used.

   It is generally in poor taste to dump every name from a namespace
   into the global namespace.

** Old =C= Standard Library

   Headers from the =C= standard library, such as =<stdlib.h>= are
   provided, albeit discouraged.

   For each such header there is also a version with its name prefixed
   by =c= and the =.h= removed.

   #+BEGIN_EXAMPLE
<stdio.h>  => <cstdio>
<stdlib.h> => <cstdlib>
   #+END_EXAMPLE

   This version places its declarations in the =std= namespace.

   #+BEGIN_SRC cpp
#include <cmath>

int main() {
  std::sqrt(3);
}
   #+END_SRC

** Strings

   STL =<string>= provides common string operations.

   #+BEGIN_SRC cpp
#include <iostream>
#include <string>
using namespace std;

int main() {
  string s{"12345678"};
  cout << s.substr(1, 3) << endl;

  s.replace(0, 1, "abcd");
  cout << s << endl;

  cout << s + "hello" << endl;
  cout << s.c_str() << endl;
}
   #+END_SRC

** Regular Expression

   STL =<regex>= provides regular expression support.

   #+BEGIN_SRC cpp
#include <regex>
#include <iostream>
using namespace std;

int main() {
  regex pat{"\\(\\d{3}\\) \\d{3}-\\d{4}"};
  if (regex_match("(334) 333-0610", pat))
    cout << "Match" << endl;

  pat = R"(\b(sub)([^ ]*))";
  string s{"this subject has a submarine as a subsequence"};
  for (sregex_iterator i(s.begin(), s.end(), pat);
       i != sregex_iterator{}; ++i)
    cout << i->str() << endl;
}
   #+END_SRC

** I/O Streams

   The I/O stream library provides formatted and unformatted buffered
   I/O of text and numeric values.

   - =ostream= converts typed objects to a stream of characters bytes.
   - =istream= converts a stream of characters bytes to typed objects.

** Output

   In =<ostream>= , the I/O stream library defines output for every
   built-in type.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int main() {
  cout << 3 << 3.3 << 'a' << "hello" << bool << endl;
}
   #+END_SRC

   The operator =<<=, i.e., "put to", is used as an output operator on
   objects of type ostream.  By overloading this operator, we can
   serialize user-defined objects.

   Predefined =ostream= objects:
   - =cout= standard output stream, connects to =stdout=.
   - =cerr= standard stream to report errors, connects to =stderr=.

** Input

   In =<istream>= , the I/O stream library defines input for every
   built-in type.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int main() {
  int a;
  double b;
  char c;
  cin >> a >> b >> c;
}
   #+END_SRC

   The operator =>>=, i.e., "get from", is used as an input operator.
   By default, a whitespace character, e.g., a space or a newline,
   delimits one read.  =getline()= is used get a whole line,
   /including/ the terminating newline character.

** I/O State

   An iostream has a state that we can examine to determine whether an
   operation succeeded.

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;

int main() {
  int i;
  while (cin >> i) {
    cout << i << endl;
  }
}
   #+END_SRC

   In general, the I/O state holds all the information needed to read
   or write, such as formatting information, error state (e.g.,
   end-of-file), and what kind of buffering is used.

** I/O of User-Defined Type

   #+BEGIN_SRC cpp
#include <iostream>
using namespace std;
struct Point {
  int x, y;
};
ostream& operator<<(ostream& os, const Point& p) {
  os << '(' << p.x << ',' << p.y << ')';
}
istream& operator>>(istream& is, Point& p) {
  is >> p.x >> p.y;
}
int main() {
  Point p;
  cin >> p;
  cout << p << endl;
}
   #+END_SRC

** File Stream

   In =<fstream>= , the STL provides streams to and from a file:
   - =ifstream= :: read from a file
   - =ofstream= :: write to a file
   - =fstream= :: two way stream, both read from and write to a file


   #+BEGIN_SRC cpp
#include <fstream>
using namespace std;

int main() {
  ofstream out("file.txt");
  ifstream in("file.txt");
}
   #+END_SRC

   The usage of =ofstream= and =ifstream= is same as =cout= and =cin=.

** String Stream

   In =<sstream>=, the STL provides streams to and from a string:
   - =istringstream= :: read from a string
   - =ostringstream= :: write to a string
   - =stringstream= :: read from and write to a string


   #+BEGIN_SRC cpp
#include <sstream>
#include <iostream>
using namespace std;
int main() {
  stringstream s;
  s << 3 << 'a' << "abd";
  cout << s.str() << endl;
  int a;
  char b;
  string c;
  s >> a >> b >> c;
  cout << a << b << c << endl;
}
   #+END_SRC

** Stream Consideration

   1. Streams are are /type-safe/, /type-sensitive/, and /extensible/
   2. It is, however, horribly /slow/.
   3. Not fast and succinct as =printf= and =sprintf=.

      #+BEGIN_SRC cpp
#include <cstdio>   // printf
#include <iostream> // cout
#include <iomanip>  // setprecision, fixed
using namespace std;

int main() {
  cout << setprecision(2) << fixed << 1.23456 << "\n";
  printf("%.2f\n", 1.23456);
}
      #+END_SRC


   Personally, I would fall back to =printf= and =sprintf= whenever
   possible.

** Containers

   Various data structures are implemented.

   - =<vector>= :: dynamic array
   - =<map>= :: dynamic sorted key-value pair
   - =<set>= :: mathematical set
   - =<unordered_map>= :: hashmap
   - =<unordered_set>= :: hashset
   - =<queue>= :: priority_queue, normal queue
   - =<deque>= :: double-linked queue
   - =<stack>= :: stack

** Algorithms

   All routines are included in =<algorithm>=.

   - Non-modifying sequence operations, e.g., =all_of=, =any_of=,
     =count=, =find=, =find_first_of=, etc.
   - Modifying sequence operations, e.g., =copy=, =copy_if=,
     =remove_if=, =swap=, =reverse=, etc.
   - Partitioning operations, e.g., =partition=, =stable_partition=.
   - Sorting operations, e.g., =sort=, =is_sorted=, =partial_sort=,
     =stable_sort=, and etc.
   - Binary search operations (on sorted ranges), =lower_bound=,
     =upper_bound=, =binary_search=, etc.

** Algorithms Cont'd

   - Set operations (on sorted ranges), =merge=, =inplace_merge=,
     =set_difference=, etc.
   - Heap operations, =is_heap=, =make_heap=, =push_heap=, =pop_heap=,
     =sort_heap=, etc.
   - Minimum/maximum operations, =max=, =min=, =minmax=,
     =lexicographical_compare=, =next_permutation=, etc.

** Utilities

   - Dynamic memory management.  Smart pointers (e.g., =unique_ptr=,
     =shared_ptr=), allocators (e.g., =std::allocator=).
   - Pair and tuples.  =pair=, =tuple= and etc.
   - =bitset=, manipulate bits.

