slide/tutorial-cpp/tutorial-cpp.tex

\begin{frame}[fragile,label={sec:orgheadline61}]{Use Standard Library}
 Every standard library is provided through some standard header.

\begin{minted}[]{cpp}
#include <vector>               // vetor container
#include <string>               // string support

int main() {
  std::vector<int> v0{1, 2, 3};
  std::vector<std::string> v1{"string", "string"};
}
\end{minted}

The standard library is defined in a namespace called \texttt{std}.  To
use standard library utilities, the \texttt{std::} prefix can be used.

It is generally in poor taste to dump every name from a namespace
into the global namespace.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline62}]{Old \texttt{C} Standard Library}
 Headers from the \texttt{C} standard library, such as \texttt{<stdlib.h>} are
provided, albeit discouraged.

For each such header there is also a version with its name prefixed
by \texttt{c} and the \texttt{.h} removed.

\begin{verbatim}
<stdio.h>  => <cstdio>
<stdlib.h> => <cstdlib>
\end{verbatim}

This version places its declarations in the \texttt{std} namespace.

\begin{minted}[]{cpp}
#include <cmath>

int main() {
  std::sqrt(3);
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline63}]{Strings}
 STL \texttt{<string>} provides common string operations.

\begin{minted}[]{cpp}
#include <iostream>
#include <string>
using namespace std;

int main() {
  string s{"12345678"};
  cout << s.substr(1, 3) << endl;

  s.replace(0, 1, "abcd");
  cout << s << endl;

  cout << s + "hello" << endl;
  cout << s.c_str() << endl;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline64}]{Regular Expression}
 STL \texttt{<regex>} provides regular expression support.

\begin{minted}[]{cpp}
#include <regex>
#include <iostream>
using namespace std;

int main() {
  regex pat{"\\(\\d{3}\\) \\d{3}-\\d{4}"};
  if (regex_match("(334) 333-0610", pat))
    cout << "Match" << endl;

  pat = R"(\b(sub)([^ ]*))";
  string s{"this subject has a submarine as a subsequence"};
  for (sregex_iterator i(s.begin(), s.end(), pat);
       i != sregex_iterator{}; ++i)
    cout << i->str() << endl;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline65}]{I/O Streams}
 The I/O stream library provides formatted and unformatted buffered
I/O of text and numeric values.

\begin{itemize}
\item \texttt{ostream} converts typed objects to a stream of characters bytes.
\item \texttt{istream} converts a stream of characters bytes to typed objects.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline66}]{Output}
 In \texttt{<ostream>} , the I/O stream library defines output for every
built-in type.

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int main() {
  cout << 3 << 3.3 << 'a' << "hello" << bool << endl;
}
\end{minted}

The operator \texttt{<<}, i.e., "put to", is used as an output operator on
objects of type ostream.  By overloading this operator, we can
serialize user-defined objects.

Predefined \texttt{ostream} objects:
\begin{itemize}
\item \texttt{cout} standard output stream, connects to \texttt{stdout}.
\item \texttt{cerr} standard stream to report errors, connects to \texttt{stderr}.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline67}]{Input}
 In \texttt{<istream>} , the I/O stream library defines input for every
built-in type.

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int main() {
  int a;
  double b;
  char c;
  cin >> a >> b >> c;
}
\end{minted}

The operator \texttt{>>}, i.e., "get from", is used as an input operator.
By default, a whitespace character, e.g., a space or a newline,
delimits one read.  \texttt{getline()} is used get a whole line,
\emph{including} the terminating newline character.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline68}]{I/O State}
 An iostream has a state that we can examine to determine whether an
operation succeeded.

\begin{minted}[]{cpp}
#include <iostream>
using namespace std;

int main() {
  int i;
  while (cin >> i) {
    cout << i << endl;
  }
}
\end{minted}

In general, the I/O state holds all the information needed to read
or write, such as formatting information, error state (e.g.,
end-of-file), and what kind of buffering is used.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline69}]{I/O of User-Defined Type}
 \begin{minted}[]{cpp}
#include <iostream>
using namespace std;
struct Point {
  int x, y;
};
ostream& operator<<(ostream& os, const Point& p) {
  os << '(' << p.x << ',' << p.y << ')';
}
istream& operator>>(istream& is, Point& p) {
  is >> p.x >> p.y;
}
int main() {
  Point p;
  cin >> p;
  cout << p << endl;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline70}]{File Stream}
 In \texttt{<fstream>} , the STL provides streams to and from a file:
\begin{description}
\item[{\texttt{ifstream}}] read from a file
\item[{\texttt{ofstream}}] write to a file
\item[{\texttt{fstream}}] two way stream, both read from and write to a file
\end{description}


\begin{minted}[]{cpp}
#include <fstream>
using namespace std;

int main() {
  ofstream out("file.txt");
  ifstream in("file.txt");
}
\end{minted}

The usage of \texttt{ofstream} and \texttt{ifstream} is same as \texttt{cout} and \texttt{cin}.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline71}]{String Stream}
 In \texttt{<sstream>}, the STL provides streams to and from a string:
\begin{description}
\item[{\texttt{istringstream}}] read from a string
\item[{\texttt{ostringstream}}] write to a string
\item[{\texttt{stringstream}}] read from and write to a string
\end{description}


\begin{minted}[]{cpp}
#include <sstream>
#include <iostream>
using namespace std;
int main() {
  stringstream s;
  s << 3 << 'a' << "abd";
  cout << s.str() << endl;
  int a;
  char b;
  string c;
  s >> a >> b >> c;
  cout << a << b << c << endl;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline72}]{Stream Consideration}
 \begin{enumerate}
\item Streams are are \emph{type-safe}, \emph{type-sensitive}, and \emph{extensible}
\item It is, however, horribly \emph{slow}.
\item Not fast and succinct as \texttt{printf} and \texttt{sprintf}.

\begin{minted}[]{cpp}
#include <cstdio>   // printf
#include <iostream> // cout
#include <iomanip>  // setprecision, fixed
using namespace std;

int main() {
  cout << setprecision(2) << fixed << 1.23456 << "\n";
  printf("%.2f\n", 1.23456);
}
\end{minted}
\end{enumerate}


Personally, I would fall back to \texttt{printf} and \texttt{sprintf} whenever
possible.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline73}]{Containers}
 Various data structures are implemented.

\begin{description}
\item[{\texttt{<vector>}}] dynamic array
\item[{\texttt{<map>}}] dynamic sorted key-value pair
\item[{\texttt{<set>}}] mathematical set
\item[{\texttt{<unordered\_map>}}] hashmap
\item[{\texttt{<unordered\_set>}}] hashset
\item[{\texttt{<queue>}}] priority\_queue, normal queue
\item[{\texttt{<deque>}}] double-linked queue
\item[{\texttt{<stack>}}] stack
\end{description}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline74}]{Algorithms}
 All routines are included in \texttt{<algorithm>}.

\begin{itemize}
\item Non-modifying sequence operations, e.g., \texttt{all\_of}, \texttt{any\_of},
\texttt{count}, \texttt{find}, \texttt{find\_first\_of}, etc.
\item Modifying sequence operations, e.g., \texttt{copy}, \texttt{copy\_if},
\texttt{remove\_if}, \texttt{swap}, \texttt{reverse}, etc.
\item Partitioning operations, e.g., \texttt{partition}, \texttt{stable\_partition}.
\item Sorting operations, e.g., \texttt{sort}, \texttt{is\_sorted}, \texttt{partial\_sort},
\texttt{stable\_sort}, and etc.
\item Binary search operations (on sorted ranges), \texttt{lower\_bound},
\texttt{upper\_bound}, \texttt{binary\_search}, etc.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline75}]{Algorithms Cont'd}
 \begin{itemize}
\item Set operations (on sorted ranges), \texttt{merge}, \texttt{inplace\_merge},
\texttt{set\_difference}, etc.
\item Heap operations, \texttt{is\_heap}, \texttt{make\_heap}, \texttt{push\_heap}, \texttt{pop\_heap},
\texttt{sort\_heap}, etc.
\item Minimum/maximum operations, \texttt{max}, \texttt{min}, \texttt{minmax},
\texttt{lexicographical\_compare}, \texttt{next\_permutation}, etc.
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline76}]{Utilities}
 \begin{itemize}
\item Dynamic memory management.  Smart pointers (e.g., \texttt{unique\_ptr},
\texttt{shared\_ptr}), allocators (e.g., \texttt{std::allocator}).
\item Pair and tuples.  \texttt{pair}, \texttt{tuple} and etc.
\item \texttt{bitset}, manipulate bits.
\end{itemize}
\end{frame}
