slide/tutorial-cpp/tutorial-cpp.org
** Numerics

   - In =<cmath>=, standard mathematical functions include =sqrt()=,
     =log()=, =sin()= and etc. for type =float=, =double= and =long
     double=.
   - Complex numbers, in =<complex>=.
   - Random numbers, in =<random>=.
   - Numeric limits, in =<numeric_limits>=.  E.g.,
     =std::numeric_limits<int>::max()=.

** Concurrency

   The standard library directly supports concurrent execution of
   multiple threads in a single address space.

** Summary

   - Core languages features
   - STL libraries


   For more information about =C++=.  Online resources include
   - http://cppreference.com
   - http://www.cplusplus.com/

* COMMENT Dummy

  #  LocalWords:  SETUPFILE cpp SRC iostream namespace cout endl IDE
  #  LocalWords:  CodeBlocks multi signedness bool STL xFEEL decltype
  #  LocalWords:  PL's lvalue rvalue AtBeginSection beamer argc argv
  #  LocalWords:  frametitle tableofcontents currentsection runtime env
  #  LocalWords:  preprocessor milti BMCOL const cstdio abcd printf de
  #  LocalWords:  destructor goto func struct typedef libpoint pri enum
  #  LocalWords:  libdir ostream Stroustrup IOCCC CentOS getline unary
  #  LocalWords:  bitwise initializer constexpr Cont'd declarator cond
  #  LocalWords:  nullptr
