slide/tutorial-cpp/tutorial-cpp.tex

\begin{frame}[fragile,label={sec:orgheadline77}]{Numerics}
 \begin{itemize}
\item In \texttt{<cmath>}, standard mathematical functions include \texttt{sqrt()},
\texttt{log()}, \texttt{sin()} and etc. for type \texttt{float}, \texttt{double} and \texttt{long
     double}.
\item Complex numbers, in \texttt{<complex>}.
\item Random numbers, in \texttt{<random>}.
\item Numeric limits, in \texttt{<numeric\_limits>}.  E.g.,
\texttt{std::numeric\_limits<int>::max()}.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline78}]{Concurrency}
The standard library directly supports concurrent execution of
multiple threads in a single address space.
\end{frame}

\begin{frame}[fragile,label={sec:orgheadline79}]{Summary}
 \begin{itemize}
\item Core languages features
\item STL libraries
\end{itemize}


For more information about \texttt{C++}.  Online resources include
\begin{itemize}
\item \url{http://cppreference.com}
\item \url{http://www.cplusplus.com/}
\end{itemize}
\end{frame}
\end{document}
